package org.example;

public class InfoAboutService {

    public void isInfoAboutServiceFirst() {
        System.out.println("Рады приветствовать в нашем приложении.");
        System.out.println("Наше приложении работает, исходя из указанного Вами возраста. Поэтому Вам необходимо ввести дату своего рождения.");
        System.out.println("После чего на экране появится полный список компаний, которые подходят для Вашего возраста. ");
        System.out.println("В дальнейшем Вы можете произвести отбор по 5-ти категориям: ");
        System.out.println("1. месту нахождения компании, для чего необходимо будет ввести интересующий Вас город (на сегодня это Берлин, Мюнхен и Нюрберг)");
        System.out.println("2. по форме собственности компании, то есть сделать выбор между государственными компаниями и частными");
        System.out.println("3. по половому признаку, то есть выбрать компании, в которых обучают только мужчин, только женщин или всех желающих");
        System.out.println("4. по сфере деятельности компании, для чего надо будет написать одно из указанных при выборе данной категории в приложении значений");
        System.out.println("5. по форме работы компании, то есть, работают компании только он-лайн, только в помещении компании или же обе формы деятельностию");
        System.out.println("Находясь в любой категории, Вы можете выйти из нее как с сохранением результата, так и без него.");
        System.out.println("Также Вы можете вернуться в самое начало поиска или выйти из приложения");
        System.out.println("Для чего просим следовать инструкциям, которые будут появляться при работе с приложением.");
        System.out.println("Желаем удачи!");
    }
}
